[{"visible":true,"created_at":"2021-02-10 10:06 上午 NZDT","editted_at":null,"id":5,"authorid":29,"title":"zzzzzzzzzzzz","content":"{\"ops\":[{\"insert\":\"zzzzzzzzz\\n\"}]}"},{"visible":true,"created_at":"2021-02-10 10:09 上午 NZDT","editted_at":null,"id":6,"authorid":39,"title":"cc","content":"{\"ops\":[{\"insert\":\"ccc\\n\"}]}"},{"visible":true,"created_at":"2021-02-12 23:24 下午 NZDT","editted_at":"2021-02-12 23:25 下午 NZDT","id":15,"authorid":62,"title":"Creating Secure Password Resets With JSON Web Tokens","content":"{\"ops\":[{\"insert\":\"\\nDoes your site still send password reminders via email? This should be a red flag to you, as both a user of the website and as a developer. Either your password is stored in plain text or it can be decrypted, instead of having the much stronger, more secure one-way encryption.\\nWhen a user of your application has forgotten their password, it can and should be reset securely. To accomplish a secure password reset, I will demonstrate how to use JSON Web Tokens (JWT) to generate a URL-safe token. The JWT contains encoded information about the user and a signature that, when decoded, is validated to ensure that the token has not been tampered with.\\nOnce the JWT is validated, your application can securely allow the user to generate a new password, instead of sending them their forgotten one.\\n“Why Can’t I Just Send The User Their Password?”\"},{\"attributes\":{\"header\":3},\"insert\":\"\\n\"},{\"insert\":\"There was a time when your password was stored in your favorite website’s database just as you typed it. In fact, it still seems to occur far too often. An entire website is dedicated to telling people whether their \"},{\"attributes\":{\"link\":\"https://haveibeenpwned.com/\"},\"insert\":\"email address or username has been exposed\"},{\"insert\":\".\\nIn those days (and I use the past tense loosely), when a user forgot their password, they would arrive on a page that asked for their username or email address. The website would then send them an email “reminding” them of their password. This should be a \"},{\"attributes\":{\"bold\":true},\"insert\":\"red flag\"},{\"insert\":\" to you, as both a user of the website and as a developer. Either your password is \"},{\"attributes\":{\"bold\":true},\"insert\":\"stored in plain text or it can be decrypted\"},{\"insert\":\", instead of having the much stronger, more secure one-way encryption.\\nBecause (secure) passwords cannot be decrypted, that leaves us with one of two common choices when a user forgets their password:\\nGenerate a new, temporary password and send it via email.\"},{\"attributes\":{\"list\":\"ordered\"},\"insert\":\"\\n\"},{\"insert\":\"Generate an email that contains a one-time-use link within the contents of the email, which will take the user to a page where they can enter a new secure password.\"},{\"attributes\":{\"list\":\"ordered\"},\"insert\":\"\\n\"},{\"insert\":\"Both options send out an email, which in the long term should not be considered a secure storage medium. With the first option, the password is shown in plain text. If the user were to leave this email in their inbox as their method of remembering their password (especially because they didn’t choose it), it would be \"},{\"attributes\":{\"italic\":true},\"insert\":\"almost\"},{\"insert\":\" as insecure as writing down their password on a sticky note and leaving it beside their computer. OK, not that bad, but you get the idea.\\nAnother concern with option one is that a malicious user who knows their email address could easily lock out a user from the website by resetting their password. If the malicious user repeated this over and over again, it would make it almost impossible for the user to ever log in again because their password would never remain the same.\\n\\nteest\\n\"}]}"},{"visible":true,"created_at":"2021-02-15 14:30 下午 NZDT","editted_at":"2021-02-15 14:32 下午 NZDT","id":23,"authorid":65,"title":"3222222","content":"{\"ops\":[{\"attributes\":{\"bold\":true},\"insert\":\"wdwqdqw\"},{\"insert\":\"\\n\"},{\"attributes\":{\"underline\":true,\"italic\":true,\"bold\":true},\"insert\":\"ghgh\"},{\"insert\":\"\\n\"},{\"attributes\":{\"underline\":true,\"italic\":true,\"bold\":true},\"insert\":\"big\"},{\"insert\":{\"image\":\"https://i.ibb.co/QcGhCBB/batman.png\"}},{\"attributes\":{\"header\":1},\"insert\":\"\\n\"}]}"}]